t = [('郭文聪', 'B类', 1), ('李文月', 'B类', 7), ('罗绪娟', 'B类', 1), ('王美园', 'B类', 1), ('王宁', 'B类', 3), ('王文秀', 'B类', 13), ('张国瑞', 'B类', 2), ('曹慧', 'C类', 1), ('房佳琳', 'C类', 9), ('郭文聪', 'C类', 3), ('罗绪娟', 'C类', 7),('孟林林', 'C类', 5), ('汤凤娇', 'C类', 6), ('唐甜甜', 'C类', 2), ('王娇', 'C类', 4), ('王美园', 'C类', 5), ('王晓玉', 'C类', 3), ('武文倩', 'C类', 2), ('尹成凯', 'C类', 4), ('张海伟', 'C类', 4), ('张敬迪', 'C类', 4), ('周丽', 'C类', 3), ('曹慧', '放弃', 2), ('房佳琳', '放弃', 3), ('李文月', '放弃', 31), ('罗绪娟', '放弃', 10), ('孟林林', '放弃', 42), ('汤凤娇', '放弃', 20), ('唐甜甜', '放弃', 1), ('王娇', '放弃', 7), ('王美园', '放弃', 15), ('王宁', '放弃', 13), ('王晓玉', '放弃', 10), ('武文倩', '放弃', 1), ('张海伟', '放弃', 3), ('周丽', '放弃', 6), ('李文月', '已成交', 4), ('孟林林', '已成交', 3), ('汤凤娇', '已成交', 6), ('王美园', '已成交', 2), ('王宁', '已成交', 5), ('王文秀', '已成交', 1), ('王晓玉', '已成交', 9), ('尹成凯', '已成交', 1), ('张国瑞', '已成交', 1), ('张海伟', '已成交', 2), ('周丽', '已成交', 1)]

name = set([i[0] for i in t])
d={}
for i in name:
	d[i]=['','','','','','']
cj={}
for i in t:
	name = i[0]
	if i[1]=='已成交':
		d[name][0]=i[2]
	elif d[name][0]=='':
		d[name][0]=0
	if i[1]=='A类':
		d[name][1]=i[2]
	elif d[name][1]=='':
		d[name][1]=0
	if i[1]=='B类':
		d[name][2]=i[2]
	elif d[name][2]=='':
		d[name][2]=0
	if i[1]=='C类':
		d[name][3]=i[2]
	elif d[name][3]=='':
		d[name][3]=0
	if i[1]=='放弃':
		d[name][4]=i[2]
	elif d[name][4]=='':
		d[name][4]=0
	all_count = d[name][0]+d[name][1]+d[name][2]+d[name][3]+d[name][4]
	d[name][5]=all_count
print(d)
	